* Last Updated: 2024. 04. 05
* File name: []
* Data: 
* Subject: 

/*****************************
*                            *
*****************************/
/*
cd "C:\Dropbox\學習\碩士\碩論"
	 
/*****************************************
*                                        *
******************************************/
est clear
use "10 data\TYPSleep__240315.dta", clear
*/

/*****************************************
*             正/負面情緒               *
******************************************/

/*************************************************************************
快樂

lookfor 快樂
di r(varlist)
tabm ///
bs602000_w2 cs901000_w3 es143000_w5 fs610000_w6 is055000_w9 m3s063000_w12
*************************************************************************/
gen happy_w2 = bs602000_w2
gen happy_w3 = cs901000_w3
gen happy_w5 = es143000_w5
gen happy_w6 = fs610000_w6
gen happy_w9 = is055000_w9
gen happy_w12 = m3s063000_w12

foreach x of num 2 3 5 6 9 12 {
	mvdecode happy_w`x', mv(7/9)
	if (`x' <= 6) replace happy_w`x' = 5 - happy_w`x'
		else recode happy_w`x' (1 = 4)(2 = 3.33)(3 = 2.67)(4 = 2)(5 =1)
	/* drop if happy_w`x' == . */
}

/*************************************************************************
憂鬱

bs615001_w2 - bs615006_w2 bs615008_w2 - bs615011_w2 bs615014_w2 - bs615016_w2
cs919001_w3 - cs919006_w3 cs919008_w3 - cs919011_w3 cs919014_w3 - cs919016_w3
es119000_w5 - es121000_w5 es123000_w5 - es125000_w5
fs609001_w6 - fs609006_w6 fs609008_w6 - fs609011_w6 fs609014_w6 - fs609016_w6
is059001_w9 - is059006_w9 is059008_w9 - is059011_w9 is059014_w9 - is059016_w9
m3s076010_w12 - m3s076060_w12 m3s076080_w12 - m3s076110_w12 m3s076140_w12 - m3s076160_w12
*************************************************************************/

global dep0_w2 "bs615001_w2 - bs615006_w2 bs615008_w2 - bs615011_w2 bs615014_w2 - bs615016_w2"
global dep0_w3 "cs919001_w3 - cs919006_w3 cs919008_w3 - cs919011_w3 cs919014_w3 - cs919016_w3"
global dep0_w5 "es119000_w5 - es121000_w5 es123000_w5 - es125000_w5"
global dep0_w6 "fs609001_w6 - fs609006_w6 fs609008_w6 - fs609011_w6 fs609014_w6 - fs609016_w6"
global dep0_w9 "is059001_w9 - is059006_w9 is059008_w9 - is059011_w9 is059014_w9 - is059016_w9"
global dep0_w12 "m3s076010_w12 - m3s076060_w12 m3s076080_w12 - m3s076110_w12 m3s076140_w12 - m3s076160_w12"

tabm $dep0_w2 $dep0_w3 $dep0_w5 $dep0_w6 $dep0_w9 $dep0_w12 , m

foreach x of var $dep0_w2 $dep0_w3 $dep0_w5 $dep0_w6 $dep0_w9 $dep0_w12 {
	mvdecode `x', mv(6/9)
}

foreach x of num 2 3 5 6 9 12{
	egen dep_w`x' =  rmean( ${dep0_w`x'} ) 
}
